CF/InformationRegisters/ВидыОсобыхНалоговОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ВидыОсобыхНалоговОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидНалога</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРозничнаяТорговляОблагаетсяЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CF/Enums/ТипыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТорговыйЗал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СкладскоеПомещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/InformationRegisters/ВидыОсобыхНалоговОрганизаций/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Отбор") Тогда
		
		Если Параметры.Отбор.Свойство("Склад") Тогда
			
			Склад = Параметры.Отбор.Склад;
			Если Склад = Неопределено
				ИЛИ Склад.ТипСклада <> Перечисления.ТипыСкладов.ТорговыйЗал Тогда
				
				ТекстЗаголовка = НСтр("ru = 'Для элемента: ""%Склад%"" ЕНВД не применяется'");
				Элементы.Список.ТолькоПросмотр = Истина;
				
			Иначе
				ТекстЗаголовка = НСтр("ru = 'Применение ЕНВД (%Склад%)'");
				ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(
					Список,
					"Организация",
					Склад.Организация,
					ЗначениеЗаполнено(Склад.Организация));
			КонецЕсли;
				
			ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Склад%", Строка(Склад));
			АвтоЗаголовок  = Ложь;
			Заголовок      = ТекстЗаголовка;
			
		ИначеЕсли Параметры.Отбор.Свойство("Организация") Тогда
			Если ТипЗнч(Параметры.Отбор.Организация) = Тип("СправочникСсылка.Организации") Тогда
				ТекстЗаголовка = "";
				АвтоЗаголовок  = Ложь;
				ТекстЗаголовка = НСтр("ru = 'Применение ЕНВД (%Организация%)'");
				ТекстЗаголовка = СтрЗаменить(ТекстЗаголовка, "%Организация%", Строка(Параметры.Отбор.Организация));
				Заголовок      = ТекстЗаголовка;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") 
		ИЛИ Параметры.Отбор.Свойство("Организация") Тогда
		Элементы.Организация.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.ВидыОсобыхНалоговОрганизаций.Форма.ФормаСписка.Открытие");

КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
    
    // &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.ВидыОсобыхНалоговОрганизаций.Форма.ФормаЗаписи.Открытие");

КонецПроцедуры

#КонецОбласти
